v = [int]*10000
i = 0
v[i] = ['Ничего не найдено!', 'ключ']; i += 1
v[i] = ['Матрица - прямоугольная таблица каких-либо элементов.', 'матрица']; i += 1
v[i] = ['Элементы - числа составляющие матрицу', 'элемент элементы']; i += 1
v[i] = ['Нулевая - все элементы строки равны нулю', 'нулевая строка']; i += 1
v[i] = ['Строчная матрциа - матрица, состоящая из единственной строки', 'строчная матрица']; i += 1
v[i] = ['Столбцовая - матрица, состоящая из единственного столбца', 'столбцовая столбцевая']; i += 1
v[i] = ['Квадратная матрица - матрица, имеющая одинаковое количество строк и столбцов или же размер n x n', 'квадратная матрица']; i += 1
v[i] = ['Главная диагональ - диагональ, идущая из левого верхнего угла матрицы в правый нижний ее угол', 'главная диагональ']; i += 1
v[i] = ['Побочная диагональ - диагональ, идущая из левого нижнего угла матрицы в правый верхний ее угол', 'побочная диагональ']; i += 1
v[i] = ['Нулевая матрица - матрица, у которой все элементы равны нулю', 'нулевая матрица']; i += 1
v[i] = ['Диагональная матрица - квадратная матрица, у которой все элементы, не принадлежащие главной диагонали, равны нулю', 'диагональная матрица']; i += 1
v[i] = ['Скалярная матрица - диагональная матрица S, у которой все диагональные элементы равны между собой', 'скалярная матрица']; i += 1
v[i] = ['Еденичная матрица - диагональная матрица с единицами на главной диагонали', 'единичная матрица']; i += 1
v[i] = ['Треугольная матрица - квадратная матрица, у которой все элементы выше главной диагонали или ниже её равны нулю', 'треугольная матрица']; i += 1
v[i] = ['Симметричная матрица - квадратная матрица, элементы которой симметричны относительно главной диагонали', 'симметричная матрица']; i += 1
v[i] = ['Транспонированная матрица - матрица А^T, полученная из исходной матрицы А, заменой строк на столбцы', 'транспонированная матрица']; i += 1
v[i] = ['Обратная матрица - такая матрица A^T, при умножении на которую исходная матрица А дает в результате единичную матрицу Е', 'обратная матрица']; i += 1
v[i] = ['Ортогональная матрица - квадратная матрица А с вещественными элементами, результат умножения которой на А^T равен единичной матрице', 'ортогональная матрица']; i += 1
v[i] = ['Ступенчатая матрица - матрица, которая содержит m строк и у которой первые r <= m диагональных элементов ненулевые, а элементы, лежащие ниже главной диагонали и элементы последних m — r строк равны нулю', 'ступенчатая матрица']; i += 1
v[i] = ['Противоположной матрицей к матрице А, называется матрица, обозначаемая «- А», такая, что А + (- А) = О, где О - нулевая матрица того же размера, что и матрица А', 'противоположная матрица']; i += 1
v[i] = ['Определитель - скалярное значение, которое является функцией элементов квадратной матрицы', 'определитель']; i += 1
v[i] = ['1 - При транспонировании матрицы величина определителя сохраняется 2 - При перестановки двух строк( или двух столбцов) определитель сохраняет свою абсолютную величину, но меняет знак на противоположный 3 - Если один из столбцов определителя является линейной комбинацией других его столбцов, то определитель равен линейной комбинации определителей ', 'свойства определителей']; i += 1
v[i] = ['', 'линейная комбинация строк']; i += 1
v[i] = ['Тривиальная линейная комбинация строк - линейная комбинация, у которой все если все коэффициенты λ-итого ,равны нулю одновременно', 'тривиальная линейная комбинация строк']; i += 1
v[i] = ['Нетривиальная линейная комбинация строк -линейная комбинация, у которой все если все коэффициенты λ-итого , не равны нулю одновременно', 'нетривиальная линейная комбинация строк']; i += 1
v[i] = ['Линейно независимая строка - строка, у которой тривиальная линейная комбинация строк равна нулевой строке', 'линейно независимая строка']; i += 1
v[i] = ['Ранг матрицы - максимальное количество линейно независимых строк системы', 'ранг матрицы']; i += 1
v[i] = ['Строчный ранг - ранг системы строк', 'строчный ранг матрицы']; i += 1
v[i] = ['Столбцовый ранг матрицы - ранг системы столбцов', 'столбоцовый столбцевой ранг матрицы']; i += 1
v[i] = ['Минор матрицы (первого типа) - определитель, составленный из элементов матрицы, расположенных на пересечении каких- либо строк и столбцов. Обозначается как буква M', 'минор первого типа матрицы']; i += 1
v[i] = ['Минор второго типа - определитель, составленный из элементов матрицы, оставшихся после вычёркивания каких- либо строк и столбцов. Обозначается как буква М с чертой ‾‾ сверху', 'минор второго типа матрицы']; i += 1
v[i] = ['Базисный минор - любой минор, который отличен от нуля', 'базисный']; i += 1
#
v[i] = ['Множество - некоторая определенная совокупность объектов или элементов', 'множество']; i += 1
v[i] = ['Элементы множества - это объекты, из которых составлено множество. Обозначают маленькими латинскими буквами', 'элементы множества']; i += 1
v[i] = ['Универсальное множество - это множество, обладающее таким свойством, что все рассматриваемые множества являются его подмножествами', 'универсальное множество']; i += 1
v[i] = ['Пустое множество - это множество, которое не содержит элементов', 'пустое множество']; i += 1
v[i] = ['Множество А является подмножеством множества В, если каждый элемент множества А является элементом множества В', 'подмножество']; i += 1
v[i] = ['Пусть множество A пересаекает множество B и A != B,то множество А является собственным подмножеством множества В', 'собственное подмножество']; i += 1
v[i] = ['Объединением двух множеств А и В называется множество всех элементов, которые принадлежат к множеству А или в множеству В', 'объединение']; i += 1
v[i] = ['Пересечением двух множеств А и В называется множество всех элементов, которые принадлежат к множеству А и в множеству В', 'пересечение']; i += 1
v[i] = ['Если все множества рассматриваются в данное время и являются подмножествами фиксированного универсального множества и, тогда определяют универсальное дополнение (дополнение множества А), как множество элементов, которые принадлежат U, но не принадлежат А', 'универсальное дополнение']; i += 1
v[i] = ['Симметрической разностью множеств А и В называется множество, которое состоит из элементов либо множества А, либо множества В, но не входящих в оба эти множества одновременно', 'симметричная разность множеств']; i += 1
v[i] = ['Мощность любого конечного множества равна количеству элементов данного множества', 'мощность']; i += 1
v[i] = ['Два множества являются равномощными, если между ними можно установить взаимно-однозначную соотвествие', 'равномощные множества равномощное']; i += 1
v[i] = ['Мощность множества действительных чисел называется континуум', 'континиуум']; i += 1
v[i] = ['Для данного множества S говорят о булеан S (класс всех подмножеств множества S)', 'булеан']; i += 1
v[i] = ['Коммутативность - любые два элемента можно менять местами', 'коммутативность']; i += 1
v[i] = ['Ассоциативность - результат операции не зависит от порядка ее выполнения', 'ассоциативность']; i += 1
v[i] = ['Идемпотентность - формулы алгебры множеств не имеют ни степеней, ни коэффициентов', 'идемпотентность']; i += 1
v[i] = ['Дистрибутивность - раскрытие скобок и вынесение общего элемента', 'дистрибутивность']; i += 1
v[i] = ['Законы поглощения - большее по числу переменных пересечение(объединение)  поглощаются меньшими', 'законы поглощения']; i += 1
v[i] = ['Законы де Моргана - дополнение пересечения(объединения) нескольких множеств заменяется на объединение(пересечение) дополнений каждого из этих множеств', 'законы де моргана']; i += 1
v[i] = ['Инволюция - дополнение дополнения множества дает исходное множество', 'инволюция']; i += 1
v[i] = ['Формулировка 1. Пусть P - некоторое утверждение, определенное на положительных целых числах ( на натуральных числах) т.е. утверждение P(n) либо истинно, либо ложно для каждого n из N. Если для P выполняются два следующих свойства :P(1) истинно P(n+1) истинно, если P(n),Тогда P истинно для каждого положительного целого. Формулировка 2.Пусть P - некоторое утверждение на N. Если выполняются свойства(условия):P(1) - истинно P(n+1) - истинно, если P(n) истинно для  K; 1  kn Тогда P - истинно для каждого n', 'принципы математической индукции']; i += 1
v[i] = [' Многочлен, образованные из фундаментальных произведений единственным образом задает любое подмножество разбиения, такой многочлен называют каноническим', 'канонический многочлен']; i += 1
v[i] = ['Множество операций пересечений и дополнений, удовлетворяющих абстрактным законам рассмотренным ранее, образуют алгебраическую систему, называемую алгеброй множеств', 'алгебра множеств']; i += 1
v[i] = ['Выражением алгебра множеств Е (или формулой) называются выражение, составленное из этих переменных, соединенных при помощи операции объединения, пересечений и дополнений', 'выражение алгеброй множеств']; i += 1
v[i] = ['Литералом называется переменная или дополнение переменной', 'литерал']; i += 1
v[i] = ['Произведением называется литерал или пересечении двух или более литералов, таких, что не одна пара из них не содержит одной и той же переменной', 'произведение']; i += 1
v[i] = ['Если при "n" переменных произведения состоит из n литералов, то его называют фундаментальным произведением', 'фундаментальное произведение']; i += 1
v[i] = ['Выражение, представляющее собой объединение различных произведений. если в нём нет ни одного произведения, которое включается в другое произведение, называют суммой произведений', 'сумма произведений']; i += 1
v[i] = ['Если выражение состоит из объединения фундаментальных произведений, то такое выражение называют полной нормальной формой объединения пересечений', 'пнф  полная нормальная форма объединения пересечений']; i += 1
v[i] = ['', '']; i += 1
v[i] = ['', '']; i += 1
